# 차근차근 데이터 분석과 인공지능_with python
import pandas as pd
df = pd.DataFrame({
    '반': ['1반', '1반', '2반', '2반', '3반', '3반', '4반', '4반', '5반', '5반'],
    '이름': ['김철수', '이영희', '박민수', '최수지', '강다연', '오준혁', '서예지', '한준호', '정민우', '이소연'],
    '성별': ['남', '여', '남', '여', '여', '남', '여', '남', '남', '여'],
    '국어': [85, 92, 78, 88, 94, 67, 81, 73, 89, 90],
    '수학': [95, 85, 80, 92, 70, 88, 76, 84, 91, 78],
    '응시여부': ['응시', '응시', '응시', '미응시', '응시', '미응시', '응시', '응시', '응시', '미응시'],
    '확인여부': ['확인', '확인', '미확인', '확인', '확인', '미확인', '확인', '미확인', '확인', '확인']
})

# 인덱스 타입으로 출력됨으로 list 형태로 변환해줘야 한다
print(df.index)
print(list(df.index))

# 인덱스 타입으로 출력됨으로 list 형태로 변환해줘야 한다
print(df.columns)
print(list(df.columns))

print(df.size)
